fio_test/log/128k/128k_seq_rw_14job_QD1.log
libpmem: (g=0): rw=rw, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libpmem, iodepth=1
...
fio-3.20
Starting 14 threads
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
[...]

libpmem: (groupid=0, jobs=14): err= 0: pid=44776: Fri Mar  5 08:08:52 2021
  read: IOPS=60.3k, BW=7542MiB/s (7908MB/s)(2210GiB/300001msec)
    clat (usec): min=26, max=174, avg=39.18, stdev= 3.12
     lat (usec): min=26, max=174, avg=39.20, stdev= 3.12
    clat percentiles (nsec):
     |  1.00th=[32128],  5.00th=[34560], 10.00th=[35584], 20.00th=[36608],
     | 30.00th=[37632], 40.00th=[38144], 50.00th=[39168], 60.00th=[39680],
     | 70.00th=[40704], 80.00th=[41728], 90.00th=[43264], 95.00th=[44288],
     | 99.00th=[47360], 99.50th=[48896], 99.90th=[52480], 99.95th=[54528],
     | 99.99th=[60672]
   bw (  MiB/s): min= 6844, max= 8172, per=100.00%, avg=7553.96, stdev=14.36, samples=8386
   iops        : min=54756, max=65382, avg=60431.66, stdev=114.88, samples=8386
  write: IOPS=60.3k, BW=7542MiB/s (7908MB/s)(2210GiB/300001msec); 0 zone resets
    clat (usec): min=78, max=696, avg=189.58, stdev=33.31
     lat (usec): min=79, max=703, avg=190.26, stdev=33.31
    clat percentiles (usec):
     |  1.00th=[  137],  5.00th=[  149], 10.00th=[  155], 20.00th=[  163],
     | 30.00th=[  172], 40.00th=[  178], 50.00th=[  184], 60.00th=[  192],
     | 70.00th=[  200], 80.00th=[  212], 90.00th=[  233], 95.00th=[  253],
     | 99.00th=[  302], 99.50th=[  318], 99.90th=[  359], 99.95th=[  371],
     | 99.99th=[  408]
   bw (  MiB/s): min= 7064, max= 7736, per=100.00%, avg=7554.13, stdev= 5.94, samples=8386
   iops        : min=56517, max=61890, avg=60433.02, stdev=47.50, samples=8386
  lat (usec)   : 50=49.85%, 100=0.15%, 250=47.21%, 500=2.79%, 750=0.01%
  cpu          : usr=99.90%, sys=0.01%, ctx=1291, majf=0, minf=41065
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=18100582,18100963,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=7542MiB/s (7908MB/s), 7542MiB/s-7542MiB/s (7908MB/s-7908MB/s), io=2210GiB (2372GB), run=300001-300001msec
  WRITE: bw=7542MiB/s (7908MB/s), 7542MiB/s-7542MiB/s (7908MB/s-7908MB/s), io=2210GiB (2373GB), run=300001-300001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%