fio_test/log/128k/128k_seq_rw_18job_QD1.log
libpmem: (g=0): rw=rw, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libpmem, iodepth=1
...
fio-3.20
Starting 18 threads
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
[...]

libpmem: (groupid=0, jobs=18): err= 0: pid=44953: Fri Mar  5 08:20:46 2021
  read: IOPS=56.4k, BW=7052MiB/s (7395MB/s)(2066GiB/300001msec)
    clat (usec): min=26, max=147, avg=39.77, stdev= 3.77
     lat (usec): min=26, max=147, avg=39.81, stdev= 3.77
    clat percentiles (nsec):
     |  1.00th=[31872],  5.00th=[34048], 10.00th=[35072], 20.00th=[36608],
     | 30.00th=[37632], 40.00th=[38656], 50.00th=[39680], 60.00th=[40704],
     | 70.00th=[41728], 80.00th=[42752], 90.00th=[44288], 95.00th=[46336],
     | 99.00th=[49920], 99.50th=[51456], 99.90th=[55552], 99.95th=[57600],
     | 99.99th=[63744]
   bw (  MiB/s): min= 6176, max= 7809, per=100.00%, avg=7057.92, stdev=13.23, samples=10764
   iops        : min=49404, max=62471, avg=56457.44, stdev=105.89, samples=10764
  write: IOPS=56.4k, BW=7052MiB/s (7395MB/s)(2066GiB/300001msec); 0 zone resets
    clat (usec): min=75, max=795, avg=274.98, stdev=52.85
     lat (usec): min=76, max=796, avg=275.69, stdev=52.86
    clat percentiles (usec):
     |  1.00th=[  186],  5.00th=[  204], 10.00th=[  215], 20.00th=[  231],
     | 30.00th=[  243], 40.00th=[  255], 50.00th=[  269], 60.00th=[  281],
     | 70.00th=[  297], 80.00th=[  318], 90.00th=[  347], 95.00th=[  371],
     | 99.00th=[  429], 99.50th=[  453], 99.90th=[  506], 99.95th=[  529],
     | 99.99th=[  578]
   bw (  MiB/s): min= 6493, max= 7231, per=100.00%, avg=7057.43, stdev= 5.67, samples=10764
   iops        : min=51944, max=57853, avg=56452.86, stdev=45.34, samples=10764
  lat (usec)   : 50=49.52%, 100=0.48%, 250=17.96%, 500=31.98%, 750=0.06%
  lat (usec)   : 1000=0.01%
  cpu          : usr=99.88%, sys=0.01%, ctx=1867, majf=0, minf=52889
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=16925591,16924929,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=7052MiB/s (7395MB/s), 7052MiB/s-7052MiB/s (7395MB/s-7395MB/s), io=2066GiB (2218GB), run=300001-300001msec
  WRITE: bw=7052MiB/s (7395MB/s), 7052MiB/s-7052MiB/s (7395MB/s-7395MB/s), io=2066GiB (2218GB), run=300001-300001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%