fio_test/log/128k/128k_seq_rw_20job_QD1.log
libpmem: (g=0): rw=rw, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libpmem, iodepth=1
...
fio-3.20
Starting 20 threads
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
[...]

libpmem: (groupid=0, jobs=20): err= 0: pid=45057: Fri Mar  5 08:27:49 2021
  read: IOPS=52.8k, BW=6597MiB/s (6917MB/s)(1933GiB/300002msec)
    clat (usec): min=26, max=160, avg=39.57, stdev= 3.95
     lat (usec): min=26, max=160, avg=39.62, stdev= 3.95
    clat percentiles (nsec):
     |  1.00th=[31872],  5.00th=[33536], 10.00th=[34560], 20.00th=[36096],
     | 30.00th=[37120], 40.00th=[38144], 50.00th=[39168], 60.00th=[40192],
     | 70.00th=[41216], 80.00th=[42752], 90.00th=[44800], 95.00th=[46336],
     | 99.00th=[49920], 99.50th=[51968], 99.90th=[56064], 99.95th=[58112],
     | 99.99th=[63744]
   bw (  MiB/s): min= 5806, max= 7361, per=100.00%, avg=6601.68, stdev=12.12, samples=11980
   iops        : min=46452, max=58889, avg=52809.86, stdev=96.96, samples=11980
  write: IOPS=52.8k, BW=6596MiB/s (6917MB/s)(1932GiB/300002msec); 0 zone resets
    clat (usec): min=80, max=990, avg=334.39, stdev=60.40
     lat (usec): min=81, max=991, avg=335.12, stdev=60.41
    clat percentiles (usec):
     |  1.00th=[  221],  5.00th=[  247], 10.00th=[  262], 20.00th=[  285],
     | 30.00th=[  302], 40.00th=[  314], 50.00th=[  330], 60.00th=[  343],
     | 70.00th=[  363], 80.00th=[  383], 90.00th=[  416], 95.00th=[  445],
     | 99.00th=[  502], 99.50th=[  529], 99.90th=[  578], 99.95th=[  603],
     | 99.99th=[  660]
   bw (  MiB/s): min= 6109, max= 6764, per=100.00%, avg=6601.10, stdev= 4.54, samples=11980
   iops        : min=48878, max=54114, avg=52804.87, stdev=36.28, samples=11980
  lat (usec)   : 50=49.46%, 100=0.54%, 250=3.07%, 500=46.40%, 750=0.52%
  lat (usec)   : 1000=0.01%
  cpu          : usr=99.86%, sys=0.01%, ctx=4253, majf=0, minf=57553
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=15832510,15831010,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=6597MiB/s (6917MB/s), 6597MiB/s-6597MiB/s (6917MB/s-6917MB/s), io=1933GiB (2075GB), run=300002-300002msec
  WRITE: bw=6596MiB/s (6917MB/s), 6596MiB/s-6596MiB/s (6917MB/s-6917MB/s), io=1932GiB (2075GB), run=300002-300002msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%