fio_test/log/128k/128k_seq_rw_24job_QD1.log
libpmem: (g=0): rw=rw, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libpmem, iodepth=1
...
fio-3.20
Starting 24 threads
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
[...]

libpmem: (groupid=0, jobs=24): err= 0: pid=45244: Fri Mar  5 08:41:30 2021
  read: IOPS=48.3k, BW=6032MiB/s (6325MB/s)(1767GiB/300001msec)
    clat (usec): min=25, max=401, avg=39.29, stdev= 3.95
     lat (usec): min=25, max=402, avg=39.39, stdev= 3.96
    clat percentiles (nsec):
     |  1.00th=[32128],  5.00th=[33536], 10.00th=[34560], 20.00th=[35584],
     | 30.00th=[37120], 40.00th=[38144], 50.00th=[39168], 60.00th=[40192],
     | 70.00th=[41216], 80.00th=[42240], 90.00th=[44288], 95.00th=[46336],
     | 99.00th=[49920], 99.50th=[51968], 99.90th=[56064], 99.95th=[58624],
     | 99.99th=[64256]
   bw (  MiB/s): min= 5266, max= 6876, per=100.00%, avg=6038.31, stdev=10.56, samples=14352
   iops        : min=42128, max=55008, avg=48301.77, stdev=84.42, samples=14352
  write: IOPS=48.3k, BW=6033MiB/s (6326MB/s)(1767GiB/300001msec); 0 zone resets
    clat (usec): min=73, max=1196, avg=451.31, stdev=63.16
     lat (usec): min=73, max=1197, avg=452.15, stdev=63.17
    clat percentiles (usec):
     |  1.00th=[  322],  5.00th=[  359], 10.00th=[  375], 20.00th=[  400],
     | 30.00th=[  416], 40.00th=[  433], 50.00th=[  445], 60.00th=[  461],
     | 70.00th=[  478], 80.00th=[  502], 90.00th=[  537], 95.00th=[  562],
     | 99.00th=[  627], 99.50th=[  652], 99.90th=[  709], 99.95th=[  734],
     | 99.99th=[  799]
   bw (  MiB/s): min= 5705, max= 6163, per=100.00%, avg=6038.96, stdev= 2.68, samples=14352
   iops        : min=45646, max=49310, avg=48306.18, stdev=21.45, samples=14352
  lat (usec)   : 50=49.48%, 100=0.52%, 250=0.01%, 500=39.84%, 750=10.14%
  lat (usec)   : 1000=0.02%
  lat (msec)   : 2=0.01%
  cpu          : usr=99.82%, sys=0.01%, ctx=4661, majf=0, minf=69951
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=14477028,14478607,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=6032MiB/s (6325MB/s), 6032MiB/s-6032MiB/s (6325MB/s-6325MB/s), io=1767GiB (1898GB), run=300001-300001msec
  WRITE: bw=6033MiB/s (6326MB/s), 6033MiB/s-6033MiB/s (6326MB/s-6326MB/s), io=1767GiB (1898GB), run=300001-300001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%